"use strict";

// ========================================================
// ======================= CALL BACK ======================
// ========================================================
function learnJS (lang, callback) {
  console.log(`Я вчу: ${lang}`);
  callback();
}

learnJS('JavaScript', function() {
  console.log('Я пройшов цей урок!');
});

// ========================================================
// ========================== АБО =========================
// ========================================================
function learnJS (lang, callback) {
  console.log(`Я вчу: ${lang}`);
  callback();
}

function done () {
  console.log('Я пройшов цей урок!');
}

learnJS('JavaScript', done); 
// done без дужок, бо вона сперш підставляється замість callback, а потім виконується на місці callback();
