"use strict";
// =============================================================================
// ============================= Старі методи ===================================
// =============================================================================
const box = document.getElementById('box'); 
// Має бути лише один id-елемент на сторінці з таким іменем.
console.log(box);

const btns = document.getElementsByTagName('button'); // Виведуться всі елемнти з даним тегом.
// Аби отримати конкретний ставимо [].
console.log(btns);

const circles = document.getElementsByClassName('circle'); // отримуємо елементи через клас
console.log(circles); // Отримаємо HTML колекцію circle



// =============================================================================
// ============================= Нові методи ===================================
// =============================================================================
const hearts = document.querySelectorAll('.heart');
// Якщо робимо виббірку по селектору, то потрібно вказувати . або #
console.log(hearts); // NodeList(3) [div.heart, div.heart, div.heart]

// Також метод вибирає усі елементи зі сторінки.
hearts.forEach(item => {
  console.log(item);
});

const oneHeart = document.querySelector('.heart'); // Вертає самий перший елемет який попадеться  з даним класом
console.log(oneHeart);




