"use strict";

let str = 'some';
let strObj = new String(str);
console.log(typeof(str)); //str 
console.log(typeof(strObj)); //object
// Якщо виводимо із строки якийсь метот, то js обгортає цю строку в об'єкт 
// І після модифікації знову повертається, як строка
// Коли ми створюємо масив ми створюємо новий екземпляр прототипа масиву


// =================================================
// ========== Спосіб створення прототипів ==========
// =================================================
const soldier = {
  health: 400,
  armor: 100,
  sayHello: function() {
    console.log('hello');
  }
}; 


const jonh = Object.create(soldier); // Створємо О jonh який прототипно наслідується від soldier. Для того аби джон мав також доступ до ф-ій властивостей
Object.setPrototypeOf(jonh, soldier); // прототип Джону від солдата
jonh.sayHello();



// ========================================================
// ========== Старий спосіб створення прототипів ==========
// ========================================================
// const soldier = {
//   health: 400,
//   armor: 100
// };

// const jonh = {
//   health: 200
// };

// jonh.__proto__ = soldier;  
// // Завдяки цьому прототипу, jonh отримає властивість armor яку успадкує від прототипу soldier.
// console.log(jonh);
// console.log(jonh.armor); // 100 наслідуване з прототипу