"use strict";
const box = document.getElementById('box'), // по id 
      btns = document.getElementsByTagName('button'), // псевдомасив з кнопок
      circles = document.getElementsByClassName('circle'), 
      hearts = document.querySelectorAll('.heart'), // усі елементи з класом
      oneHeart = document.querySelector('.heart'), // перший, що трапився з класом 
      wrapper = document.querySelector('.wrapper'); 

// ======================================================
// ================= Редагування стилів =================
// ======================================================
box.style.backgroundColor = 'blue'; // елемент.йогоОб'єктСтайл.властивість = "значення";
box.style.width = '500px';
// або 
box.style.cssText = 'background-color:blue; width: 500px'; 
// властивості css  у js (inline) записуються у форматі камелКейс. І перебивають усі інші
// властивість cssText дозволяє передавати css стилі  у вигляді тексту



btns[2].style.borderRadius = '100%'; // вказуємо індекс, аби вибрати яку саме, бо btns це псевдомасив кнопок
circles[1].style.backgroundColor = 'green';
let num = 100;
btns[4].style.cssText = `background-color: gray; width: ${num}px`;
// Аби передати значення властивості використовуєм інтерполяцію



// =============================================================
// ========== Дії одночасно над декількома елементими ==========
// =============================================================
// for - на практиці майже не використовують
for (let i = 0; i < btns.length; i++) {
  btns[i].style.backgrounColor = 'blue';
} 
// задаємо bg для усіх елементів сторінки 

//______________________________________________________________
// !!! Метот forEach працює тільки коли використовуємо querySelectorAll
/* hearts.forEach(item => {
  item.style.backgroundColor = 'blue';
}); */



// ==============================================================
// ========== Методи для роботи з елементами  сторінки ==========
// ==============================================================
const div = document.createElement('div'); // сворюємо елемент div який існує тільки в середині js.

div.classList.add('black'); // для div назначаємо клас .black  якому задані стилі в css

// _______________Розташування створеного блоку__________________
document.body.append(div); // додаємо створений div в кінець body.

// document.querySelector('.wrapper').append(div); // вибираємо секцію wrapper і в кінець поміщаємо блок div

// Якщо чсто використовуємо секцію, то винесемо в окрему перемінну let wrapper = document.querySelector('.wrapper');
// wrapper.prepend(div); // Додаємо блок на початок вказаної секції (wrapper)

// Також для того аби вставити блок можна скористатися псевдокласами 
// hearts[0].before(div); // перед першим сердечком вставиться div
// hearts[0].after(div); // після першого сердечка 


// _______________________________________________________________
// circles[0].remove(); // видалити елемент
// _______________________________________________________________
// hearts[1].replaceWith(circles[1]);
// замінюємо сердечко першим кільцем:що змінюємо.метод.(чим змінюємо)



// ===========================================================
// ================== Застарілі конструкції ==================
// ===========================================================
// wrapper.appendChild(div); // добавляє блок в кінець сторінки

// wrapper.insertBefore(div, hearts[0]); // перший аргумент - що вставляємо, другий - перед чим вставляємо

// wrapper.removeChild(hearts[1]); // батько.метод.елемент видалення 

// wrapper.replaceChild(circles[0], hearts[0]); // батько.метод(що змінюємо.чим змінюємо) - замінна елементів

// ===========================================================
// div.innerHTML = 'Hello World'; // Вставляємо текст в div
// або
// div.textContent = 'Hello'; // якщо просто потрібно добавити текст. Працює лише з текстом

// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
// div.innerHTML = '<h1>Hello World</h1>'; // якщо потрібна робота з HTML структурою




// ===========================================================
// ==================== Практичні навики =====================
// ===========================================================
// div.innerHTML = '<h1>Hello World</h1>';
// div.insertAdjacentHTML('beforebegin', '<h2>Hello</h2>'); 
// Вставляє код перед елементом div

div.insertAdjacentHTML('afterbegin', '<h2>Hello</h2>'); // вставляє код на початок нашого елементу div

div.insertAdjacentHTML('beforeend', '<h3>Hello</h3>'); // якщо ми хочемо вставити код у кінець нашого елементa div

div.insertAdjacentHTML('afterend', '<h4>Hello</h4>'); // вставлє код після елемента div

// Якщо ми вже маємо доступ до секції 
const section = document.getElementById('section'); 
// і подальші робити потрібно проводити з елементами,які находяться в секції,
// то можна відразу писати section а не document
// const someElem = section.querySelector('.heart');