"use strict";
// ================================================================
// =========================== ФУНКЦІЇ ============================
// ================================================================
let num = 20; // глобальна перемінна

function showFirstMessage(text) {
  console.log(text);
  let num = 10; // якщо об'являємо перемінну в середині ф-ії то ззовні вона не доступна - локальна
  console.log(num);
}

showFirstMessage('hello world');
console.log(num);

// замикання ф-ії - це сама функція з усіма зовнішніми перемінними, які їй доступні.

function calc (a, b) {
  let c = a + b;
  return c; // повертає значчення на ззовні
  console.log('Hello'); // після return будь-які дії припиняються (мервий код)
}

console.log(calc(5, 6)); // 11
console.log(calc(3, 2)); // 5


function ret() {
  let num = 50;
  return num;
}

const anotherNum = ret();
console.log(anotherNum);


// =============== Сучасний стандарт ===============
// =================================================
// =============== Стрілочна функція ===============
// Стрілочна ф-ія обов'язково має присвоюватися в переміну.

// const calculator = a => a**3; 
// console.log(calculator(5)); // 125
// якщо лише 1 аргумент (a) то () можна не ставити.

// const calculator = (a, b) => a + b + a**2 ;
// якщо в тілі ф-ії лише 1 вираз то {} можна не ставити

const calculator = (a, b) => {
  console.log('1');  // 1ий вираз
  return a + b ; // 2ий вираз 
};

console.log(calculator(5, 20));



// ==============================================================================
// ================================= Практика ===================================
// ==============================================================================

