"use strict";
// ==========================================================
// ======================= Строки ===========================
// ==========================================================

// МЕТОДИ
const str = 'some teSt';

// console.log (str.toLocaleUpperCase()); // Великі літерали
// console.log (str.toLowerCase()); // Малі літерали
// console.log (str.indexOf('teSt')); // дізнаємося початковий індекс вказаної строки
// Шукаємо позицію елемента. Якщо задати не існуючий символ, то отримаємо -1.

// console.log(str.slice(2, 6)); // me t
// Елемент вирізається з (х, ) - включно до ( ,y); Якщо ввести тільки перший аргумент то виріжеться до кінця.
// Якщо вказати (-1, -5) аргументи то буде вирізатися з кінця

// console.log(str.substring(1, 2)); // Цей метот схожий на slice, тільки не підтримує від'ємні числа

// console.log(str.substr(2, 4));
// Елемент вирізається з (х, ) - включно на задану довжину y ( , y);


// =============== Числа ==============
// =======================================
// const num = 12.2;
// console.log(Math.round(num)); // 12

// const num = '12.2px';
// console.log(parseInt(num)); // повертає значення цілого числа
// console.log(parseFloat(num)); // повертає значення з плаваючою точкою
